Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཞུམ་པ་མེད་པའི་སེམས་ཀྱིས་ཀྱང་།
en: “Without becoming disheartened,

source: །གཡེལ་བ་མེད་པར་རི་མོ་གྱིས།
en: Venerate them unflaggingly,

source: །དེ་ནས་འོད་བྱེད་སངས་རྒྱས་སུ། །རིང་པོར་མི་ཐོགས་འགྲོ་བར་འགྱུར།
en: And become before long An illuminating buddha. {234}

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཀྱང་།
en: “Those bodhisattvas who come here

source: །ཞིང་རྣམས་སྟོང་ནས་ལྷགས་པ་རྣམས།
en: From thousands of realms

source: །འཇིག་རྟེན་སྒྲོན་མ་རབ་མཐོང་སྟེ།
en: See the lamp of the world

source: །ཆོས་ཀྱིས་མཆོག་ཀྱང་འཆད་པར་མཛད། །དཔའ་བོ་ཆེན་པོ་འདྲེན་པ་ལ།
en: Teaching the supreme Dharma. {235} “Those great heroes throw down

source: །རིན་ཆེན་ཆེན་པོས་འཐོར་བར་བྱེད།
en: Great jewels for the Guide, And in order to attain enlightenment

source: །མན་དཱ་ར་བའི་མེ་ཏོག་དག ། བྱང་ཆུབ་ཕྱིར་ནི་འཐོར་བར་བྱེད། །བླ་ན་མེད་པའི་སངས་རྒྱས་ཞིང་།
en: They cast down coral tree flowers. {236}

source: །ཞིང་འདི་རབ་ཏུ་བརྒྱན་པར་བྱེད།
en: “They adorn this realm, The highest buddha realm.

source: །ཕྱོགས་དང་ཕྱོགས་ནི་ཀུན་ཏུ་ཡང་།
en: All of the ten directions

source: །རིན་པོ་ཆེ་ཡི་དྲ་བས་གཡོགས། །བ་དན་དག་ཀྱང་གདགས་བྱས་ཤིང་།
en: Are covered with networks of jewels. {237} “They string up flags

source: །རྒྱལ་མཚན་བྱེ་བ་མངོན་པར་བསྒྲེང་། །དུ་མ་ཡི་ནི་རྒྱན་རྣམས་ཀྱིས། །ཞིང་འདི་ཤིན་ཏུ་ལེགས་པར་བརྒྱན།
en: And erect millions of banners, And they adorn this realm With endless adornments. {238} “They create countless, beautiful Pinnacled halls with balconies,

source: །ཁང་པ་བརྩེགས་པ་བྱེད་པར་འགྱུར།
en: Upper chambers, and towers

source: །རིན་ཆེན་ཀུན་གྱིས་རྣམ་པར་སྤྲས།
en: Adorned with every jewel. {239} “They create palaces with crescents,

source: །ཁང་པ་པུ་ཤུ་སྟེགས་བུ་དག །ཡིད་དུ་འོང་བ་གྲངས་མེད་རྣམས།
en: Round windows and aviaries,

source: །གཞལ་མེད་ཁང་དང་ཟླ་གམ་དང་། །སྐར་ཁུང་དེ་བཞིན་བྱ་རྒྱ་བྲེས།
en: Incense, banners, and vases,

source: །རིན་ཆེན་སྣ་ཚོགས་བརྒྱན་པ་ཡི། །བདུག་པའི་སྣོད་དུ་བདུག་པ་བདུགས།
en: And adorned with many jewels. {240}

source: །བདུག་པ་དག་ནི་བདུགས་པ་ཡིས།
en: “The aroma of incense

source: །སངས་རྒྱས་ཞིང་འདི་རབ་ཏུ་གང་།
en: Spreads through this buddha realm.

source: །དེ་ཡི་དྲི་ནི་ཡིད་འོང་བ།
en: That delightful incense

source: །ཞིང་ཡང་བྱེ་བ་སྟོང་དུ་ལྡང་།
en: Pervades a billion realms. {241}

source: །དེ་དག་ཀུན་ཏུ་ཁྱབ་བྱས་ནས།
en: “When it has spread through them

source: །སྤོས་ཀྱི་ཆར་ཡང་རབ་ཏུ་འབེབས།
en: A rain of incense falls.

source: །གང་གིས་དྲི་དེ་བསྣམས་པ་ཡང་།
en: Those who smell that incense

source: །དེ་དག་སངས་རྒྱས་འདྲེན་པར་འགྱུར།
en: Become buddhas, guides. {242}

source: །དེ་དག་འདོད་ཆགས་ཟུག་རྔུ་སྤངས།
en: “They cast away the pain of desire.

source: །ཞེ་སྡང་སྲེད་པ་ཡོང་མེད་དེ། །རྒྱ་མོ་ཆེན་པོ་རྣམ་པར་དྲལ།
en: They do not have anger and craving. The net of ignorance is destroyed

source: །མུན་པ་ཀུན་ཀྱང་མེད་པར་འགྱུར།
en: And all darkness comes to an end. {243}

source: །དེར་ནི་རྫུ་འཕྲུལ་ཐོབ་གྱུར་ཏེ།
en: “There they attain the miraculous powers,

source: །དབང་སྟོབས་བྱང་ཆུབ་ཡན་ལག་དང་། །བསམ་གཏན་ཐར་པ་རྣམ་པར་རེག །དེ་དག་སྦྱིན་པར་འོས་པར་འགྱུར།
en: And the strengths, powers, and aspects of enlightenment. They attain the dhyānas and the liberations And become worthy of offerings. {244} “Fifty million beautiful

source: །སྟན་ཡང་ཡིད་དུ་འོང་བ་རྣམས།
en: Seats are arranged,

source: །བྱེ་བ་ཕྲག་ལྔ་རབ་བཤམས་ཏེ།
en: Draped with millions of cloths

source: །རིན་ཆེན་དྲ་བས་བརྒྱན་པ་ཡི། །གོས་རྣམས་བྱེ་བ་རབ་ཏུ་བཏིང་།
en: And nets of jewels. {245}

source: །དེ་ལ་དཔའ་བོ་གྲགས་པ་ཆེ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་འདུག །མཚན་དང་དེ་བཞིན་དཔེ་བྱད་ཀྱིས།
en: “The bodhisattvas, the famous heroes, Are gathered there upon those seats. They shine with the primary signs

source: །དེ་དག་ཤིན་ཏུ་རྣམ་པར་འབར།
en: And also with the secondary signs. {246}

source: །སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་ཀྱང་།
en: “This entire buddha realm

source: །རིན་ཆེན་ཤིང་གིས་ལེགས་བརྒྱན་ཏེ། །ཡན་ལག་བརྒྱད་ལྡན་ཆུས་གང་བ། །རྫིང་བུ་དག་ནི་རྣམ་པར་སྤྲུལ།
en: Is adorned by trees made of jewels. There are emanated ponds that are filled With water that has the eight qualities. {247}

source: །རྫིང་བུའི་འགྲམ་ན་གནས་པ་རྣམས།
en: “Those on the banks of those pools

source: །དེ་དག་དེ་ལས་ཆུ་འཐུངས་ནས།
en: Who drink from their waters

source: །ཐམས་ཅད་སྲེད་པ་བསལ་ནས་ནི།
en: Are freed from all craving

source: །འཇིག་རྟེན་གྱི་ཡང་མཆོད་རྟེན་འགྱུར།
en: And become worthy of veneration by the world. {248}

source: །ཐ་དད་པ་ཡི་ཞིང་ནས་ཀྱང་།
en: “In other realms, too,

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྷགས་པ་རྣམས།
en: Bodhisattvas gather.

source: །ཤཱཀྱ་སེང་གེ་སྐྱོབ་པ་ཡི། །སངས་རྒྱས་བསྔགས་པ་རྗོད་པར་བྱེད།
en: They praise the Buddha, The lion of the Śākyas, the protector. {249}

source: །སྒྲ་དེ་སུ་དག་ཐོས་པ་ནི།
en: “Those who hear that praise

source: །དེ་དག་འཇིག་རྟེན་འདྲེན་པར་འགྱུར།
en: Become guides of the worlds. Here I have described

source: །ཕན་ཡོན་བསམ་གྱིས་མི་ཁྱབ་པ། །མདོ་སྡེ་འདི་ནི་ངས་རབ་བཤད།
en: This sūtra’s inconceivable benefits. {250}

source: །པད་མ་བྱེ་བ་བསམ་མི་ཁྱབ།
en: “Countless millions of lotuses

source: །འདབ་མ་དག་ནི་གསེར་ལས་བྱས།
en: Are emanated, which have Petals made of gold, And pericarps of uragasāra. {251}

source: །སྙིང་པོ་སྦྲུལ་གྱི་སྙིང་པོ་སྟེ། །དེར་ནི་དེ་དག་རབ་ཏུ་སྤྲུལ། །ཡལ་ག་དག་ཀྱང་བཻ་དཱུརྱ།
en: “They have stems of beryl,

source: །ཁོག་པ་དག་ནི་ཤེལ་ཡིན་ཏེ།
en: They have leaves of crystal,

source: །ཟེ་བ་དཔལ་གྱི་སྙིང་པོ་ཅན།
en: They have stamens of emerald,

source: །དེར་ནི་མཛེས་པ་རྣམས་ཀྱང་སྤྲུལ།
en: And have beautifully appeared. {252}

source: །དེ་དག་དྲི་ཡང་བསམ་མི་ཁྱབ།
en: “They have an inconceivable aroma

source: །རྒྱུན་མི་འཆད་པར་འབྱུང་བ་ཡིས།
en: That they continuously emit.

source: །ཞིང་རྣམས་བྱེ་བ་ཀུན་ཏུ་གང་། །པད་མོའི་དྲི་ནི་བསམ་མི་ཁྱབ། །ཡིད་དུ་འོང་བར་འབྱུང་བ་ཡི།
en: The inconceivable aroma of the lotuses Fills millions of realms. {i}

source: །དྲི་དེ་སུ་ཡིས་བསྣམས་པ་ཡང་།
en: “Those who smell that aroma That they delightfully emanate

source: །དེ་དག་རབ་ཏུ་སེམས་དགའ་ཞིང་།
en: Will have delight in their minds

source: །ནད་རྣམས་ཐམས་ཅད་ཞི་བར་འགྱུར།
en: And all their illnesses will cease. {253}

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་རྣམས།
en: “Desire, anger, and ignorance

source: །མ་ལུས་པར་ནི་ཟད་འགྱུར་ཏེ།
en: Will cease without trace.

source: །དེ་དག་ཉེས་པ་གསུམ་ཟད་ནས།
en: When those three faults have ceased in them

source: །སངས་རྒྱས་བདེ་བ་སྦྱིན་པར་འགྱུར།
en: They will be buddhas who bestow happiness. {254}

source: །དེ་དག་ལས་ནི་སྒྲ་འབྱུང་སྟེ།
en: “From them are emitted sounds,

source: །སངས་རྒྱས་སྒྲ་ནི་བསམ་མི་ཁྱབ།
en: Countless numbers of the word buddha. And from them also the words

source: །དམ་པའི་ཆོས་དང་དགེ་འདུན་སྒྲ། །རྣམ་པ་ཀུན་ནི་འབྱུང་བར་འགྱུར།
en: dharma and saṅgha emanate everywhere, {255}

source: །སྟོང་པ་ཉིད་དང་མཚན་མེད་དང་། །སྨོན་པ་མེད་པའི་སྒྲ་འབྱུང་སྟེ།
en: “And also the words emptiness, Absence of attributes, and absence of aspiration.

source: །དེ་ཐོས་སེམས་ཅན་བྱེ་བ་མང་། །ཕྱིར་མི་ལྡོག་པར་རབ་ཏུ་འགྱུར།
en: The progress of the numerous millions of beings Who hear them becomes irreversible. {256}

source: །སྒྲ་དེ་དག་ནི་བྱུང་བ་ཡང་།
en: “These words that are emanated

source: །ཞིང་རྣམས་བྱེ་བར་འགྲོ་བར་འགྱུར།
en: Also reach millions of realms.

source: །སེམས་ཅན་བྱེ་བ་བསམ་ཡས་རྣམས། །སངས་རྒྱས་ཡེ་ཤེས་འགོད་པར་བྱེད།
en: They establish countless millions Of beings in this buddha wisdom. {257}

source: །རྨ་བྱ་ཀ་ལ་པིང་ཀ་དང་། །ཤང་ཤང་ཏེའུ་དང་བྱ་རྣམས་ཀྱང་།
en: “The birds that are peacocks, Avadavats, and partridges

source: །དེ་དག་རབ་ཏུ་སྒྲ་འབྱིན་པ།
en: Also sing out a word,

source: །སངས་རྒྱས་སྒྲ་ནི་བླ་ན་མེད།
en: The unsurpassable word buddha. {258}

source: །ཀུ་ནལ་རི་སྐེགས་ཁྲུང་ཁྲུང་དང་། །ཁུ་བྱུག་དང་ནི་བྱ་རྣམས་ཏེ།
en: “The birds that are snipes, Mynas, cranes, and cuckoos

source: །དེ་དག་སྒྲ་ནི་འབྱིན་པ་ཡང་།
en: Also sing out a word,

source: །བསམ་གྱིས་མི་ཁྱབ་ཆོས་སྒྲ་འབྱིན།
en: The inconceivable word dharma. {i}

source: །ནེ་ཙོ་ངང་པ་ཀ་རན་ད།
en: “The birds that are parrots, geese,

source: །ངུར་པ་དང་ནི་ས་ར་ས།
en: Ducks, shelducks, and swans

source: །དེ་དག་སྒྲ་རྣམས་འབྱིན་པ་ནི།
en: Also sing out a word,

source: །བླ་མེད་དགེ་འདུན་སྒྲ་ཡང་འབྱིན།
en: The unsurpassable word saṅgha. {ii} “All the birds that there are

source: །ལྷ་དག་གི་དང་མི་ཡི་ནི།
en: In the deva or the human worlds

source: །བྱ་རྣམས་ཇི་སྙེད་གང་ཡོད་པ།
en: Are continuously singing

source: །དཀོན་མཆོག་གསུམ་གྱི་བསྔགས་པ་རྣམས། །དེ་དག་ཀུན་ཏུ་སྒྲ་ཡང་འབྱིན།
en: Praises of the Three Jewels. {iii}

source: །རིན་པོ་ཆེ་ཡི་ཤིང་རྣམས་ནི།
en: “Trees made of jewels Are manifested in this realm.

source: །བྱེ་བྲག་འཕགས་ཤིང་བལྟ་ན་སྡུག །ཡིད་འོང་ནོར་བུའི་ཤིང་རྣམས་ཀྱང་། །ཞིང་འདི་ཉིད་དུ་རྣམ་པར་སྤྲུལ།
en: Those delightful jewel trees Are uniquely beautiful. {259}

source: །ཤིང་འདི་ཀུན་ལ་རྒྱན་རྣམས་ཀྱི། །ཆུན་པོ་ཐམས་ཅད་རབ་ཏུ་འཕྱང་།
en: “On all those trees are hung Every kind of ornament. They have manifested in this realm

source: །སངས་རྒྱས་དག་གི་མཐུ་ཡིས་ནི།
en: Through the power of the Buddha. {260} “This display does not exist

source: །ཞིང་འདི་ཉིད་དུ་མངོན་པར་སྤྲུལ།
en: Anywhere in any realm. This unique, superior sight

source: །ཞིང་འདི་ན་ནི་མི་སྣང་བ། །དེ་ལྟ་བུ་ཡི་བཀོད་པ་ནི། །ཞིང་ཀུན་ན་ཡང་ཡོང་མེད་དེ། །དེ་ཚེ་ཤིན་ཏུ་བྱེ་བྲག་འཕགས།
en: Is not to be seen in this realm. {261}

source: །གོང་མ་བཞིན་དུ་འདི་དག་རྣམས།
en: “This is what has been taught

source: །ཤཱཀྱ་སེང་གེ་སྐྱོབ་པས་བཤད།
en: By the Śākya lion, the protector.

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་རྣམས།
en: The greatly famed bodhisattvas

source: །ཡེ་ཤེས་དེ་ལ་ནེམ་ནུར་མེད།
en: Have no doubt in that wisdom. {262}

source: །གང་གི་མཐའ་འདི་རྟོགས་པ་ནི།
en: “They comprehend that highest point.

source: །དེ་དག་འཇུག་པ་བསམ་ཡས་ཏེ།
en: Their way is inconceivable.

source: །ཡེ་ཤེས་ཀྱིས་ནི་རྣམ་པར་འཕེལ།
en: Their wisdom increases

source: །འབབ་ཆུ་དག་གིས་རྒྱ་མཚོ་བཞིན།
en: Like an ocean into which rivers flow. {263}

source: །དེ་དག་ལ་ཡང་མཐའ་མི་རྙེད།
en: “They have no final end.

source: །རྒྱ་མཚོ་དག་ནི་འཐུང་བ་བཞིན།
en: It is like drinking an ocean. This is the inconceivable way

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ། །བསམ་གྱིས་མི་ཁྱབ་འདི་དག་བཤད། །དཔའ་བོ་མཐའ་འདིར་གནས་པ་ཡི།
en: Of the bodhisattvas that has been taught. {264}

source: །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ལྡན་རྣམས།
en: “The greatly famed bodhisattvas, The heroes, are at the highest point.

source: །དབྱངས་ཀྱི་ཡན་ལག་རྣམ་འབྱིན་པ།
en: They give forth aspects of speech

source: །དེ་བས་དབྱངས་ཀྱང་བསམ་ཡས་ཏེ།
en: “There is such inconceivable speech

source: །བྱང་ཆུབ་སེམས་དཔའ་རློམ་སེམས་མེད།
en: But the bodhisattvas have no pride.

source: །རློམ་སེམས་རབ་ཏུ་སྤངས་པ་ན།
en: They have eliminated pride

source: །དེ་དག་སྲོག་གི་ཕྱིར་ཡང་ནི། །ཚུལ་ཁྲིམས་འདྲལ་བར་མི་བྱེད་དེ།
en: Even for the sake of their life.

source: །བྱང་ཆུབ་སེམས་དཔའ་དཀའ་ཐུབ་བརྟན།
en: The bodhisattvas are resolute

source: །དེ་ནི་མི་འདྲལ་སྤྱོད་པར་བྱེད།
en: And behave immaculately. {267} “They do not become ruined

source: །འདོད་པ་ཡི་ནི་འདུ་ཤེས་ཀྱིས། །དེ་ཀུན་ཕྱིར་ཡང་མི་འདྲལ་ཏེ།
en: By any concept of desire.

source: །ཏིང་འཛིན་དག་ནི་དཔག་ཏུ་མེད།
en: And they have countless samādhis. {268}

source: །མཉམ་པར་བཞག་པས་དེ་སྤྱོད་དེ།
en: “They practice them while in meditation

source: །ཏིང་འཛིན་ལ་ཡང་ཆགས་པ་མེད།
en: Yet have no attachment to those samādhis.

source: །ཆགས་པ་མེད་ཅིང་བག་ཡོད་པས།
en: They have no clinging, they are attentive,

source: །དེ་ནི་འཇིག་རྟེན་ཆགས་མི་བྱེད།
en: And they have no attachment to the world. {269}

source: །འཇིག་རྟེན་ཁམས་ནི་འདས་ནས་ཀྱང་།
en: “When they leave this world

source: །བདེ་བ་ཅན་དུ་དེ་འགྲོ་སྟེ།
en: They go to Sukhāvatī.

source: །དེར་སོང་ནས་ནི་དེ་ཡིས་ཀྱང་།
en: When they have arrived there

source: །སངས་རྒྱས་འོད་དཔག་མེད་པ་མཐོང་།
en: They see Buddha Amitābha. {270}

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བོ་གང་།
en: “Those bodhisattva heroes

source: །མཚན་རྣམས་ཀྱིས་ནི་ལེགས་པར་བརྒྱན། །མངོན་ཤེས་ལྔ་ལྡན་ཤེས་རབ་ཆེ།
en: Are adorned by the primary signs. They have reached the domain of the five higher cognitions, Great wisdom, and the retentions. {271}

source: །གཟུངས་རྣམས་སྤྱོད་ཡུལ་གྱུར་པ་དག །ཞིང་རྣམས་བྱེ་བར་རབ་འགྲོ་ཞིང་།
en: “They go to millions of realms

source: །སངས་རྒྱས་ཞབས་ལ་ཕྱག་ཀྱང་འཚལ།
en: And bow down to the feet of the buddhas. Shining, they travel

source: །སངས་རྒྱས་ཞིང་ནི་བསམ་ཡས་སུ། །སྣང་བར་བྱེད་ཅིང་འགྲོ་བར་འགྱུར།
en: To countless buddha realms. {272}

source: །སྐྱོན་རྣམས་ཐམས་ཅད་རབ་སྤངས་ཤིང་། །ཉོན་མོངས་ཐམས་ཅད་རྣམ་པར་སྦྱངས།
en: “They have eliminated all faults And are purified of all kleśas.

source: །ཉོན་མོངས་ཐམས་ཅད་རྒྱུན་བཅད་དེ།
en: With the kleśas completely eradicated

source: །རྒྱལ་བར་སྐྱེ་བ་གཅིག་གིས་གནས། །ཞིང་དེ་ནས་ནི་མི་རྣམས་ཀྱང་།
en: They are one lifetime from becoming a jina. {273}

source: །ངན་སོང་དུ་ཡང་མི་འགྲོ་སྟེ།
en: “They will not go to the lower realms. From that realm of humans

source: །ཞིང་དེར་ངན་སོང་ཐམས་ཅད་ཀྱང་།
en: All rebirth into the lower realms

source: །མ་ལུས་པར་ནི་ཆད་པར་འགྱུར།
en: Has been eradicated in that realm. {274} “Do not doubt what has been revealed

source: །སྐྱོབ་པ་འོད་ནི་དཔག་མེད་པ།
en: Concerning that protector,

source: །འཇིག་རྟེན་མགོན་པོས་བཤད་པ་སྟེ།
en: The Lord of the World, Amitābha,

source: །དེ་ལ་ནེམ་ནུར་མ་བྱེད་ཅིག །བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར།
en: And you will go to Sukhāvatī. {275}

source: །མདོ་སྡེ་རིན་ཆེན་འདི་ཡི་བསྔགས་པ་རྣམས། །བུད་མེད་གང་ཐོས་སེམས་ཀྱང་དད་འགྱུར་བ།
en: “A woman who has faith on hearing The praise of this precious sūtra

source: །སྐྱེས་བུ་མཁས་པ་མཆོག་ཏུ་མྱུར་འགྱུར་ཏེ།
en: Will soon become a superior wise man

source: །རྫུ་འཕྲུལ་གྱིས་ནི་ཞིང་སྟོང་བྱེ་བར་འགྲོ།
en: Who miraculously goes to billions of realms. {276}

source: །མཆོད་པ་ཚད་མེད་རྣམ་མང་ཇི་སྙེད་པ།
en: “Many offerings of innumerable kinds, Offered continuously to supreme beings

source: །ཞིང་ནི་བྱེ་བ་ཁྲག་ཁྲིག་གཏམས་སྙེད་དུ།
en: Within the appearance of a quintillion realms,

source: །སྐྱེས་བུ་མཆོག་ལ་མཆོད་པ་དེ་བྱས་པས། །བྱམས་པའི་སེམས་ལ་གྲངས་དང་ཆར་མི་ཕོད།
en: Cannot equal a fraction of a loving mind. {277}

source: །ཚུལ་ཁྲིམས་ཏིང་འཛིན་རྟག་ཏུ་བསྙེན་བྱས་ཏེ།
en: “Those who always practice correct conduct and samādhi,

source: །བསམ་གཏན་རྣམ་ཐར་དེ་བཞིན་ཚད་མེད་དང་། །སྟོང་པ་མཚན་མེད་རྟག་ཏུ་བསྙེན་བྱས་ན།
en: And also countless dhyānas and liberations, Who always practice emptiness devoid of attributes—

source: །རིང་པོར་མི་ཐོགས་འཇིག་རྟེན་བདེ་གཤེགས་འགྱུར།
en: They will soon become sugatas in the world. {278}

source: །བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་ཚོགས་གནས་པ།
en: “The bodhisattvas who maintain the aggregate of correct conduct

source: །དེས་ནི་ང་ལ་མཆོད་པ་རབ་མཆོག་བྱས།
en: Make the greatest, most special offering to me.

source: །ཟད་དུས་ཐ་མར་བྱང་ཆུབ་སེམས་གནས་པ།
en: Those who maintain the aspiration to enlightenment in the time of degeneration

source: །དེས་ནི་སངས་རྒྱས་ཐམས་ཅད་རྟག་ཏུ་མཆོད།
en: Are continuously making an offering to all the buddhas. {279}

source: །ཟད་དུས་མི་བཟད་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་།
en: “The bodhisattvas in the dreadful time of degeneration

source: །བདེ་བར་གཤེགས་པས་བསྟན་པའི་ཆོས་མཆོག་འདི་སྲུང་བ།
en: Who protect this supreme Dharma taught by the sugatas,

source: །དེ་དག་ང་ཡི་སྲས་ཏེ་ཕྱི་དུས་ཆོས་སྐྱོང་བ།
en: Are my offspring and protectors of the Dharma in the later times.

source: །དེ་དག་སངས་རྒྱས་བྱེ་བ་སྟོང་གིས་ཡོངས་སུ་གཏད།
en: They have been entrusted by ten billion buddhas.” {280}

source: །མདོ་སྡེ་འཛིན་པའི་ཕན་ཡོན་གྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གསུམ་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ།
en: Conclusion of the thirty-third chapter, “The Benefits of Possessing the Sūtra.”

source: བམ་པོ་བཅུ་གཅིག་པ།
en: Kṣemadatta Chapter 34

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མཚན་མ་མེད་པ་ལ་གནས་ཏེ་དེ་བཞིན་གཤེགས་པ་བཞུགས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དག་གི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྣམས་ལ་མཆོད་པ་རྒྱ་ཆེར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should abide in the absence of attributes and be dedicated to making vast offerings to a present tathāgata or to the stūpa of a tathāgata who has passed into nirvāṇa.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པའི་སེམས་བསྐྱེད་པས་ཏིང་ངེ་འཛིན་འདི་འདོད་པ་དང་། །མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མཚན་མ་མེད་པ་ལ་གནས་ཤིང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བས་རང་གི་ལུས་དང་སྲོག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་བཞུགས་པའམ། །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དག་གི་མཆོད་རྟེན་ལ་མཆོད་པ་མངོན་པར་འདུ་བྱ་བ་རྒྱ་ཆེར་བྱའོ།
en: “Young man, those bodhisattva mahāsattvas should develop an aspiration focused upon all beings as they wish for this samādhi. And, wishing to attain quickly the highest, complete enlightenment of perfect buddhahood, they should abide in the absence of attributes, without aspiration for the ripening of karma, and use even their own body and life to perform vast actions of making offerings to a present tathāgata or to the stūpa of a tathāgata who has passed into nirvāṇa.

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་ཡང་སྐད་གསང་མཐོ་ཞིང་ཡིད་དུ་འོང་བ་དང་། བྱེ་བྲག་ཏུ་འཕགས་པའི་ཚིག་དང་ཡི་གེ་རྒྱུན་ཆགས་པས་སྙིང་རྗེ་ཆེན་པོ་ལ་དམིགས་པའི་སེམས་དང་། ཡིད་ལ་བྱེད་པས་གཞན་ལ་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །རབ་ཏུ་གདོན་པར་བྱའོ།
en: “With their mind and attention focused on compassion; with a loud, clear voice, elevated and pleasant; and with especially noble vocabulary and a continuity of words they should teach extensively to others, propagate, and explain the samādhi, the revealed equality of the nature of all phenomena.

source: །བཤད་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: གཞོན་ནུ་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་དང་གཞི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདི་ཡིན་ནོ།
en: Because, young man, this king of samādhis, the revealed equality of the nature of all phenomena, is the basis and root of the entire Dharma.

source: །གཞོན་ནུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་། ཐབས་ཀྱིས་བརྟན་པའི་བརྩོན་འགྲུས་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་བཞུགས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དག་གི་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྣམས་ལ་མཆོད་པ་རྒྱ་ཆེར་བྱ་བ་ལ་བརྩོན་པར་གྱུར་ཅིང་།
en: “Young man, when bodhisattva mahāsattvas who have great compassion and diligently rely on methods are dedicated to making vast offerings to a present tathāgata or to the stūpa of a tathāgata who has passed into nirvāṇa, they should teach extensively to others this king of samādhis, the revealed equality of the nature of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདི་གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེའི་ཚེ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་ལ་གནས་པར་འགྱུར་ཏེ། དེ་ཆོས་གང་ལ་ཡང་མི་དམིགས་སོ།
en: “At that time, young man, those bodhisattva mahāsattvas should abide in the doorways to liberation that are emptiness, the absence of attributes, and the absence of aspiration, and should not apprehend any phenomenon whatsoever.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་དམིགས་པའི་ཏིང་ངེ་འཛིན་གྱི་རྣལ་འབྱོར་ལ་གནས་པ་ནི་སྨོན་ལམ་ཐམས་ཅད་ལ་གནས་པར་འགྱུར་རོ།
en: The bodhisattva mahāsattvas who abide in the practice of the samādhi that is free of apprehending will abide in all aspirations.

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྨོན་ལམ་ཐམས་ཅད་ལ་གནས་པ་ནི་བདག་དང་སེམས་ཅན་ཀུན་གྱི་སྨོན་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། ཏིང་ངེ་འཛིན་འདི་ཡང་མྱུར་དུ་ཐོབ་ཅིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Young man, the bodhisattva mahāsattvas who abide in all aspirations will fulfill all the aspirations of all beings, will quickly attain this samādhi, and will quickly attain the highest, complete enlightenment of perfect buddhahood.

source: །གཞོན་ནུ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཆེས་གྲངས་མེད་པ། ཡངས་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ།
en: “Young man, you should understand this through the following teaching.

source: དཔག་ཏུ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: “Young man, in the past, uncountable, vast, immeasurable, inconceivable, innumerable countless eons ago, at that time and in those days, there appeared in the world the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, who was perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, a buddha, and a bhagavān.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དབྱངས་བྱིན་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཟག་པ་ཟད་པ།
en: “Young man, the Tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta established countless, innumerable beings in the cessation of defilements, in arhatship, and having established them in that state, he passed into nirvāṇa.

source: དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་དེ། རབ་ཏུ་བཀོད་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་རབ་ཏུ་བཀོད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: He also established countless, innumerable beings in irreversible progress toward the highest, complete enlightenment of perfect buddhahood and then passed into nirvāṇa.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་འཛམ་བུའི་གླིང་ན་རྒྱལ་པོ་དཔལ་དབྱངས་ཞེས་བྱ་བས།
en: “Young man, at that time and in those days, in Jambudvīpa there was a king named Śrīghoṣa.

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་མཆོད་རྟེན་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོ་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱས་ཏེ། མཆོད་རྟེན་རེ་རེ་ལ་ཡང་མར་མེའི་ཡོན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་བཙུགས་སོ།
en: In order to make offerings to the Tathāgata who had passed into nirvāṇa he built eighty-four quintillion stūpas that contained the relics of the Tathāgata and he presented eighty-four quintillion lights to each of those stūpas.

source: །དེ་བཞིན་དུ་མཆོད་རྟེན་རེ་རེ་ལ་ཡང་རོལ་མོ་དང་། སིལ་སྙན་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕུལ་ལོ།
en: In the same way he offered eighty-four quintillion musical instruments, percussion instruments, flowers, incense offerings, perfumes, garlands, ointments, powders, robes, parasols, banners, and flags to each of those stūpas.

source: །གཞོན་ནུ་འདི་ལྟར་རྒྱལ་པོ་དཔལ་དབྱངས་ཀྱིས་མཆོད་རྟེན་དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་གྱི་སྙིང་པོ་ཅན་ལ་མཆོད་པ་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུའི་བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་བསོགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ལ་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མཆོད་པ་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: “Young man, in that way King Śrīghoṣa made offerings to the stūpas that contained the relics of the Tathāgata. Then he gathered eighty quintillion bodhisattvas and dedicated himself to making offerings of all the most pleasing necessities to those bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་སྨྲ་བ་ཡིན་ཏེ།
en: “Every one of all those bodhisattva mahāsattvas was a dharmabhāṇaka.

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པ། ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། ཆགས་པ་མེད་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ།
en: They had uninterrupted eloquence, the attainment of samādhi, and the attainment of unimpeded retention.

source: ཡང་དག་པའི་ཡོན་ཏན་གྱི་ཆོས་སྟོན་པ། ཡོངས་སུ་དག་པའི་ཆོས་སྟོན་པ། བྱང་ཆུབ་སེམས་དཔའི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤ་སྟག་གོ།
en: They were teachers of the pure Dharma, and had attained the perfection of the supreme powers of a bodhisattva.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན། འཁོར་དེའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བས་བྱིན་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Young man, at that time, within that assembly there was a bodhisattva mahāsattva named Kṣemadatta.
